Public Member Functions | Friends | List of all members
ACAPI::DesignOptions::DesignOptionCombination Class Reference
Design Options
A class that represents the design option combination of the view settings. More...
#include <DesignOptionCombination.hpp>
 Inheritance diagram for ACAPI::DesignOptions::DesignOptionCombination:
 Public Member Functions
Result< void >  | IsEditable () const
Checks whether the Design Option Combination is editable.
GS::UniString  | GetName () const
GS::Guid  | GetGuid () const
Result< void >  | SetName (const GS::UniString &newName)
Sets the name of the Design Option Combination.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | Impl::DesignOptionCombinationViewSettingsImpl
 class  | DesignOptionManager
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
A class that represents the design option combination of the view settings.
Since
Archicad 27
Member Function Documentation
◆ GetGuid()
 GS::Guid ACAPI::DesignOptions::DesignOptionCombination::GetGuid  |  ( |   | ) |   const
Returns
The guid of the combination.
◆ GetName()
 GS::UniString ACAPI::DesignOptions::DesignOptionCombination::GetName  |  ( |   | ) |   const
Returns
The name of the combination.
◆ IsEditable()
 Result< void > ACAPI::DesignOptions::DesignOptionCombination::IsEditable  |  ( |   | ) |   const
Checks whether the Design Option Combination is editable.
Returns
Ok if editable. Otherwise Error, with the reason why the combination is not editable.
◆ SetName()
 Result< void > ACAPI::DesignOptions::DesignOptionCombination::SetName  |  ( |  const GS::UniString & |  newName | )
Sets the name of the Design Option Combination.
Returns
Result of the modification.
Parameters
newName | The new name to be set.
Precondition
This function needs to be called from command scope
Example code snippets from Test / Design Options
 /*
 This function adds a new phrase to all design option combinations' names.
 */
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 ACAPI::Result<std::vector<ACAPI::DesignOptions::DesignOptionCombination>> combinationsResult = manager->GetDesignOptionCombinations ();
 if (!combinationsResult.IsOk ()) {
 WriteReport ("Failed to get Design Option Combinations.");
 return;
 }
 for (auto& combination : combinationsResult.Unwrap ()) {
 auto err = ACAPI_CallUndoableCommand ("Undo Modify Design Option Combination Name", [&combination] () -> GSErrCode {
 GS::UniString newName = combination.GetName () + " new phrase";
 if (combination.SetName (newName).IsErr ()) {
 return (GSErrCode) GS::ErrorType::Error;
 }
 return NoError;
 });
 if (err) {
 WriteReport ("Failed to Modify Design Option Combination Name.");
 }
 }